{
  "contact": {
    "email": "erkinun at gmail dot com",
    "website": "https://erkinunlu.net",
    "location": "London, United Kingdom"
  },
  "skills": [
    {
      "title": "Languages",
      "type": "tag",
      "subskills": [
        {
          "name": "Javascript"
        },
        { "name": "Typescript" },
        {
          "name": "Clojure"
        },
        {
          "name": "Scala"
        },
        {
          "name": "Java"
        },
        {
          "name": "Kotlin"
        },
        { "name": "Python" }
      ]
    },
    {
      "title": "General",
      "type": "tag",
      "subskills": [
        { "name": "Docker" },
        { "name": "Kubernetes" },
        {
          "name": "Web Development"
        },
        {
          "name": "Product Engineering"
        },
        {
          "name": "Dev Ops"
        },
        {
          "name": "Backend Development"
        },
        {
          "name": "Full Stack Development"
        }
      ]
    },
    {
      "title": "Frameworks",
      "type": "tag",
      "subskills": [
        {
          "name": "ReactJS"
        },
        {
          "name": "Express"
        },
        {
          "name": "Gatsby"
        },
        { "name": "Ring" },
        { "name": "Akka" },
        { "name": "Apache Spark" }
      ]
    },
    {
      "title": "Databases",
      "type": "tag",
      "subskills": [
        {
          "name": "Postgresql"
        },
        {
          "name": "Firebase"
        },
        { "name": "ElasticSearch" }
      ]
    }
  ],
  "summary": "Polyglot Software Engineer focused on Functional Programming. I'm currently interested in ReactJs, Typescript and Clojure.",
  "education": [
    {
      "institution": "Istanbul Technical University, Turkey",
      "degree": "Bachelor of Science (BS), Computer Engineering",
      "start": "2004",
      "end": "2008"
    }
  ],
  "experience": [
    {
      "role": "Senior Software Engineer - Contract",
      "company": "JUXT (juxt.pro)",
      "tech": "typescript, javascript, react, vite, graphql, vitest, mui, storybook, chromatic, eslint, prettier, react query, react location, docker, clojure, node, deps",
      "description": "JUXT is my first client as a contractor. I'm working on an data operations web frontend for a client of JUXT that is building their own platform to ingest and shape data using the very data operations UI I'm building. I have been the sole developer on the UI project and set up the project with React/Typescript/Vite.js and React.query with Graphql, using Eslint+Prettier, Storybook with Chromatic and Vitest for testing. I have also set up the CI/CD pipeline with Github Actions. Finally, I have been contributing to the backend of the project (when required) which is written in Clojure.",
      "start": "10/2022"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Uswitch Limited",
      "tech": "typescript, clojure, javascript, kotlin, docker, kubernetes, react, redux, ring, node, lein",
      "description": "I'm working as a senior full stack software engineer and have been contributing to the money engineering team with migration from various older tech stacks into the current framework, utilising Typescript and Javascript with Node and Kubernetes. I have previously worked with affiliate marketing platform team in the revenue estimation and product tooling projects. I've started the first React project of the said team, completed it to production and wrote the backend as a Clojure Ring App at the same time. After that I had contributed to team's product ingestion pipeline and other apis written in Clojure and Kotlin.",
      "start": "09/2019",
      "end": "09/2022"
    },
    {
      "role": "Senior Software Engineer",
      "company": "Quantemplate",
      "tech": "scala, akka, reactjs, javascript, sbt, typescript, docker, ansible, amazon-web-services, kibana, aws- lambda",
      "description": "I have been contributing to all aspects of the product including the backend services written in Scala with Akka Sharding, the frontend application which is migrating to ReactJs with Typescript and based on AWS .",
      "start": "03/2018",
      "end": "09/2019"
    },
    {
      "role": "Scala Developer",
      "company": "Jobsite UK",
      "tech": "scala, apache-spark, amazon-web-services, jenkins, sbt ",
      "description": "I was a part of the team that built the data pipeline that is being used by other applications throughout the company. I focused on writing Scala modules for the Spark pipeline.",
      "start": "02/2017",
      "end": "03/2018"
    },
    {
      "role": "Senior Devops Engineer",
      "company": "TripAdvisor",
      "tech": "java, gradle, jenkins, continuous-integration, postgresql, python, shell, svn, graphite",
      "description": "I had responsibilities for the development, build, QA and lab system of TripAdvisor. This included the development of the infrastructure, automating and monitoring it via setting up the metrics system, finally improve where possible.",
      "start": "09/2015",
      "end": "02/2017"
    },
    {
      "role": "Backend Team Leader",
      "company": "Monitise",
      "tech": "java, scala, tomcat, python, mysql, ant, maven, gradle, mercurial, sql-server, spring",
      "description": "I started as software developer, then I have taken position of Backend Team Leader. Me and my team developed BKM Express and BKM Mobile applications which are rivals to PayPal Turkey. I also developed the main part of the company's mBanking solution, which is now in further development for various customers. Both BKM Express and mBanking is written in Java and Spring Framework, Scala/Play Framework is also used in the Web Api portion of BKM Express. I was responsible of the delivery, coordination and quality of the work of Backend team.",
      "start": "03/2012",
      "end": "08/2015"
    },
    {
      "role": "Software Engineer",
      "company": "Parkyeri",
      "tech": "java, javascript, titanium",
      "description": "In Parkyeri, we have prepared a project plan, architecture, requirement, high level design and low-level class design for a EU project. The development was in Spring framework and Java. We ha CRM project for Vailant which was implemented using J2EE Servlet technology, one of natural gas heater producers in Turkey.",
      "start": "07/2011",
      "end": "03/2012"
    },
    {
      "role": "Software Engineer",
      "company": "Huawei",
      "tech": "linux, c++, ace, network-programming",
      "description": "Developed the event server and load balancing software of the service control gateway applications family. We have used linux servers with the network programming framework of ACE",
      "start": "01/2010",
      "end": "06/2011"
    },
    {
      "role": "Software Engineer",
      "company": "Smartsoft Information Technologies",
      "tech": "C#, C++",
      "description": "Developed both the front end and the backend of EMV Credit Card Fraud Prevention package, which was called SmartPack. The platform has both online and offline scenarios for fraud. For frontend I have used C# with .NET and for backend we have used C++ server applications that work on Windows Servers.",
      "start": "06/2008",
      "end": "01/2010"
    }
  ],
  "social": [
    {
      "service": "linkedin",
      "url": "https://www.linkedin.com/in/erkinunlu/"
    },
    {
      "service": "twitter",
      "url": "https://twitter.com/erkin_Unlu1"
    },
    {
      "service": "github",
      "url": "https://github.com/erkinun"
    }
  ],
  "role": "Software Engineer",
  "projects": [
    {
      "name": "TicTacToe",
      "company": "Open Source",
      "description": "Simple Tic Tac Toe game written as an exercise over a weekend, exploring how a very simple game loop operates. It is written in Vite, React and Typescript.",
      "link": "https://tictactoevitets.netlify.app/",
      "tech": ["ReactJS", "Typescript", "Vite", "Netlify", "Playwright"]
    },
    {
      "name": "Grocery List",
      "company": "Open Source",
      "description": "Grocery application written to make sharing and creating lists easier. It is written in Vite, React and Typescript.",
      "link": "https://groceriesterminal.netlify.app/dashboard",
      "tech": ["ReactJS", "Typescript", "Vite", "Netlify"]
    },
    {
      "name": "Royal Mail Label Trimmer for Etsy Sellers",
      "company": "Open Source",
      "description": "Label trimmer software developed for my wife's Etsy store in the UK. It is written in Vite, React and Typescript.",
      "link": "https://etsylabelhandler.netlify.app/",
      "tech": ["ReactJS", "Typescript", "Vite", "Netlify"]
    },
    {
      "name": "TV Movie Searcher and List maker",
      "company": "Open Source",
      "description": "A movie and tv show search and list maker application written in Vite, React and Typescript. It uses the TMDB API to fetch the data, and Firebase to store the user's lists. It is deployed to Netlify.",
      "link": "https://tvshowssearcher.netlify.app/",
      "tech": ["ReactJS", "Typescript", "Vite", "Netlify", "Firebase"]
    },
    {
      "name": "Gizem's Password Generator",
      "company": "Open Source",
      "description": "Password generator application heavily inspired by my wife's very similar work prior, helps with generating strong passwords when your browser or OS doesn't help. It is written in Vite, React and Typescript.",
      "link": "https://gizemspassgenerator.netlify.app",
      "tech": ["ReactJS", "Typescript", "Vite", "Netlify"]
    },
    {
      "name": "Workout Logging",
      "company": "Open Source",
      "description": "Workout tracker application that is written with Next.js and Typescript. It utilizes Firebase as a backend.",
      "link": "https://workouts-nextjs.vercel.app/dashboard",
      "tech": ["Next.js", "Typescript", "Firebase", "Vercel"]
    },
    {
      "name": "Bin Days",
      "company": "Open Source",
      "description": "A bin collection site I created for my neighbourhood. It is written with Next.js and Typescript.",
      "link": "https://bin-collection.vercel.app",
      "tech": ["Next.js", "Typescript", "Vercel"]
    },
    {
      "name": "Welcome to London fun page for friends",
      "company": "Open Source",
      "description": "A fun page for my friends who are visiting London. It is written in Vite, React and Typescript. It is deployed to Netlify.",
      "link": "https://ozveozanlondraseyahati.netlify.app",
      "tech": ["ReactJS", "Typescript", "Vite", "Netlify"]
    },
    {
      "name": "Rick and Morty",
      "company": "Open Source",
      "description": "Rick and Morty is one of my favourite tv shows. I have created a simple app to browse the characters and episodes of the show. I have used ReactJs, Typescript, React Query, GraphQL, and ViteJS.",
      "link": "https://lucent-piroshki-cd5b08.netlify.app/",
      "tech": [
        "Typescript",
        "ViteJS",
        "React Query",
        "Netlify",
        "GraphQL",
        "ReactJs"
      ]
    },
    {
      "name": "Weather App",
      "company": "Open Source",
      "description": "A weather tracking application built for learning purposes. It uses Next.js and Typescript.",
      "link": "https://weather-app-nextjs-erkinun.vercel.app/",
      "tech": ["Typescript", "Next.js", "Vercel"]
    },
    {
      "name": "Tv Show site",
      "company": "Open source",
      "description": "This is a React app that I built to improve my CSS skills by imitating the biggest movie database site in the web.",
      "link": "https://erkinun.github.io/TvShows/",
      "tech": ["ReactJS", "Redux", "Javascript"]
    },
    {
      "name": "Flashcards for Life in the UK test",
      "company": "Open source",
      "description": "This is a React app that I built to study for Life in the UK test, questions are loaded statically but can be improved for each user's own set of questions.",
      "link": "https://erkinun.github.io/Flashcards/",
      "tech": ["ReactJS", "Javascript", "Create React App"]
    },
    {
      "name": "Professional Psychology Counselling Site",
      "company": "Open source",
      "description": "Used the starter template from https://github.com/madelyneriksen/gatsby-starter-tyra with a Netlify CMS implementation. This is a project that I built for my wife's psychology counselling business and blog.",
      "link": "https://gizemunlu.net",
      "tech": ["GatsbyJS", "ReactJS", "Javascript"]
    },
    {
      "name": "Personal Home page and Resume",
      "company": "Open source",
      "description": "Used the starter template from https://github.com/barancezayirli/gatsby-starter-resume-cms which is a free starter template with  Netlify CMS implementation. It is easy to customize the design with thanks to tailwind theming capabilities. It uses git as a backend and can be deployed to any static hosting service like Netlify, firebase hosting or Github pages.",
      "link": "https://erkinunlu.net",
      "tech": ["GatsbyJS", "ReactJS", "Javascript"]
    },
    {
      "name": "Sporapp",
      "company": "Out of business startup",
      "description": "Social media startup for tracking workouts and planning routines and programs to reach one's goals for physical fitness.",
      "tech": ["PHP", "JQuery", "Scala", "AWS"]
    },
    {
      "name": "Wishjoin",
      "company": "Out of business startup",
      "description": "Social media look alike like Twitter to share a feed of wishes, goals and events with friends.",
      "tech": ["PHP", "JQuery"]
    }
  ],
  "todos": ["check github for more"],
  "fullname": "Erkin Ünlü"
}
